{
  "license": "Apache-2.0",
  "title": "fingeRNAt—A novel tool for high-throughput analysis of nucleic acid-ligand interactions: pymol plugin",
  "version": "0-4-2",
  "upload_type": "software",
  "publication_date": "2022-11-21",
  "language": "eng",
  "description": "<p><b>fingeRNAt—A novel tool for high-throughput analysis of nucleic acid-ligand interactions: pymol plugin</b></p><p>Computational methods play a pivotal role in drug discovery and are widely applied in virtual screening, structure optimization, and compound activity profiling. Over the last decades, almost all the attention in medicinal chemistry has been directed to protein-ligand binding, and computational tools have been created with this target in mind. With novel discoveries of functional RNAs and their possible applications, RNAs have gained considerable attention as potential drug targets. However, the availability of bioinformatics tools for nucleic acids is limited. Here, we introduce fingeRNAt&mdash;a software tool for detecting non-covalent interactions formed in complexes of nucleic acids with ligands. The program detects nine types of interactions: (i) hydrogen and (ii) halogen bonds, (iii) cation-anion, (iv) pi-cation, (v) pi-anion, (vi) pi-stacking, (vii) inorganic ion-mediated, (viii) water-mediated, and (ix) lipophilic interactions. However, the scope of detected interactions can be easily expanded using a simple plugin system. In addition, detected interactions can be visualized using the associated PyMOL plugin, which facilitates the analysis of medium-throughput molecular complexes. Interactions are also encoded and stored as a bioinformatics-friendly Structural Interaction Fingerprint (SIFt)&mdash;a binary string where the respective bit in the fingerprint is set to 1 if a particular interaction is present and to 0 otherwise. This output format, in turn, enables high-throughput analysis of interaction data using data analysis techniques. We present applications of fingeRNAt-generated interaction fingerprints for visual and computational analysis of RNA-ligand complexes, including analysis of interactions formed in experimentally determined RNA-small molecule ligand complexes deposited in the Protein Data Bank. We propose interaction fingerprint-based similarity as an alternative measure to RMSD to recapitulate complexes with similar interactions but different folding. We present an application of interaction fingerprints for the clustering of molecular complexes. This approach can be used to group ligands that form similar binding networks and thus have similar biological properties. The fingeRNAt software is freely available at <a href=\"https://github.com/n-szulc/fingeRNAt/\">https://github.com/n-szulc/fingeRNAt</a>.</p>", 
  "notes": "This work was supported by the National Science Centre in Poland (grant number 2020/39/B/NZ2/03127 to F.S.)",
  "keywords": [
    "interaction fingerprints",
    "SIFts",
    "RNA",
    "small molecules",
    "non-covalent bonds"
  ],
  "creators": [
    {
      "affiliation": "International Institute of Molecular and Cell Biology in Warsaw",
      "name": "Filip Stefaniak",
      "orcid": "0000-0001-5758-9416"
    },
    {
      "affiliation": "International Institute of Molecular and Cell Biology in Warsaw",
      "name": "Natalia A. Szulc",
      "orcid": "0000-0002-2991-3634"
    }
  ],
  "access_right": "open",
  "related_identifiers": [
    {
      "scheme": "url",
      "identifier": "https://github.com/n-szulc/fingeRNAt/",
      "relation": "isSupplementTo",
      "resource_type": "software"
    },
    {
      "scheme": "doi",
      "identifier": "10.1371/journal.pcbi.1009783",
      "relation": "isSupplementTo",
      "resource_type": "publication-article"
    }
  ]
}
